#pragma once
//1.경부고속도로 0부산-1양산-2언양(울산)-3경주-4영천-5경산-6동대구-7금호(북대구,5분기)-8김천(4분기)-9비룡(대전)-10대전-11회덕(대전)-12청주-13남이(청주)-14천안
//               -15안성-16오산-17동탄(화성)-18신갈(용인)-19판교(성남)-20금토(성남)-21서울
//2.서해안고속도로 22죽림-23목포-24함평(6분기)-25영광-26고창-27부안-28군산-29서천-30홍성-31서산-32당진-33서평택-34안산(3분기)-21서울

//3.영동 고속도로 35서창(인천)-34안산(2분기)-36수원-18신갈(용인,1분기)-37호법(이천)-38여주(4분기)-39만종-40원주-41횡성-42평창-43강릉
//4.중부내륙 44내서JC(창원)-45칠원JC(함안)-46창녕-47현풍-48고령(6분기)-49성주-8김천(1분기)-50낙동JC(상주)-51문경-52연풍(괴산)-53노은JC-54충주-38여주(3분기)-55양평

//5.중앙 7금호(북대구,1분기)-56군위-57의성-58안동JC-59예천-60영주-61단양-62제천-63신평(원주)-64홍천-65춘천

//6.광주대구선 66옥포(대구,7분기)-48고령(4분기)-67함양-68남원-69순창-70담양-71고서(광주) , 72광주-73나주-24함평(2분기)-74무안

#include "struct.h"
#include "pgh.h"

char city_number[Max_JC][20]{ "부산","양산","언양(울산)","경주","영천","경산","동대구","금호","김천","비룡","대전","회덕","청주","남이(청주)","천안","안성","오산","동탄(화성)","신갈(용인)","판교(성남)","금토(성남)","서울"
,"죽림","목포","함평","영광","고창","부안","군산","서천","홍성","서산","당진","서평택","안산"
,"서창(인천)","수원","호법(이천)","여주","만종","원주","횡성","평창","강릉"
,"내서JC(창원)","칠원JC(함안)","창녕","현풍","고령","성주","낭동JC(상주)","문경","연풍(괴산)","노은JC","충주","양평"
,"군위","의성","안동JC","예천","영주","단양","제천","신평(원주)","홍천","춘천"
,"옥포(대구)","함양","남원","순창","담양","고서(광주)"
,"광주","나주","무안" };


void set_road(JC** JCs, int R[][3], int n) {
	road* Newroad1, * Newroad2;
	for (int i = 0; i < n; i++) {
		Newroad1 = (road*)malloc(sizeof(road));
		Newroad2 = (road*)malloc(sizeof(road));
		Newroad1->distance = R[i][2];
		Newroad1->end = JCs[R[i][1]];
		Newroad1->traffic = 1.0;
		Newroad2->distance = R[i][2];
		Newroad2->end = JCs[R[i][0]];
		Newroad2->traffic = 1.0;
		JCs[R[i][0]]->adj[(JCs[R[i][0]]->part)++] = Newroad1;
		JCs[R[i][1]]->adj[(JCs[R[i][1]]->part)++] = Newroad2;
	}
}
JC** Setting_Map(int start) {
	JC* NewJC;
	JC** JCs=(JC**)malloc(sizeof(JC)* Max_JC);
	for (int i = 0; i < 75; i++) {
		NewJC = (JC*)malloc(sizeof(JC));
		NewJC->number = i;
		NewJC->part = 0;

		NewJC->select = false;
		NewJC->distance = 9999;
		NewJC->time = 0;
		NewJC->stopover = 0;
		
		JCs[i] = NewJC;
	}
	int Route1[21][3] = { {0,1,16},{1,2,28},{2,3,29},{3,4,23},{4,5,18},{5,6,11},{6,7,18},{7,8,44},{8,9,85}, {9,10,5},{10,11,3},{11,12,20},{12,13,15},{13,14,35},{14,15,30},{15,16,14},{16,17,5},
			{17,18,13},{18,19,13},{19,20,3} ,{20,21,6} };
	int Route2[13][3] = { {22,23,18},{23,24,19},{24,25,34},{25,26,17},{26,27,37},{27,28,29},{28,29,8},{29,30,70},{30,31,25},{31,32,20},{32,33,36},{33,34,35},{34,21,10} };
	int Route3[10][3] = { {35,34,17},{34,36,24},{36,18,11},{18,37,21},{37,38,22},{38,39,30},{39,40,4},{40,41,4},{41,42,41},{42,43,51} };
	int Route4[13][3] = { {44,45,16},{45,46,36},{46,47,16},{47,48,11},{48,49,24},{49,8,5},{8,50,25},{50,51,30},{51,52,57},{52,53,24},{53,54,11},{54,38,42},{38,55,37} };
	int Route5[10][3] = { {7,56,38},{56,57,8},{57,58,20},{58,59,21},{59,60,20},{60,61,18},{61,62,13},{62,63,46},{63,64,42},{64,65,11} };
	int Route6[6][3] = { {66,48,9},{48,67,70},{67,68,42},{68,69,27},{69,70,21},{70,71,4} };
	int Route6_2[3][3] = { {72,73,13},{73,24,22},{24,74,4} };
	
	set_road(JCs, Route1, 21);
	set_road(JCs, Route2, 13);
	set_road(JCs, Route3, 10);
	set_road(JCs, Route4, 13);
	set_road(JCs, Route5, 10);
	set_road(JCs, Route6, 6);
	set_road(JCs, Route6_2, 3);
	return JCs;
}
